{"blogid": "124558627", "writerAge": "码龄19年", "writerBlogNum": "53", "writerCollect": "57", "writerComment": "28", "writerFan": "141", "writerGrade": "4级", "writerIntegral": "1361", "writerName": "懒是一种态度", "writerProfileAdress": "writer_image\\profile_124558627.jpg", "writerRankTotal": "42470", "writerRankWeekly": "57631", "writerThumb": "30", "writerVisitNum": "100108", "blog_read_count": "804", "blog_time": "已于 2022-05-09 21:14:27 修改", "blog_title": "composer 安装问题", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"style.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<p>如果出现下面情况，不管怎么百度都不好用，就用我的方法吧！</p>\n<blockquote>\n<p>Loading composer repositories with package information<br/> Updating dependencies<br/> Your requirements could not be resolved to an installable set of packages.</p>\n<p>  Problem 1<br/>     - Root composer.json requires aws/aws-sdk-php, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 2<br/>     - Root composer.json requires cloudflare/sdk, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 3<br/>     - Root composer.json requires esdeathlove/datatables, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 4<br/>     - Root composer.json requires firebase/php-jwt, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 5<br/>     - Root composer.json requires illuminate/database, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 6<br/>     - Root composer.json requires illuminate/pagination, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 7<br/>     - Root composer.json requires irazasyed/telegram-bot-sdk, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 8<br/>     - Root composer.json requires khanamiryan/qrcode-detector-decoder, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 9<br/>     - Root composer.json requires league/omnipay, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 10<br/>     - Root composer.json requires anankke/omnipay-alipay, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 11<br/>     - Root composer.json requires mailgun/mailgun-php, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 12<br/>     - Root composer.json requires paymentwall/paymentwall-php, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 13<br/>     - Root composer.json requires phpmailer/phpmailer, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 14<br/>     - Root composer.json requires ramsey/uuid, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 15<br/>     - Root composer.json requires robmorgan/phinx, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 16<br/>     - Root composer.json requires sendgrid/sendgrid, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 17<br/>     - Root composer.json requires sentry/sentry, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 18<br/>     - Root composer.json requires slim/slim, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 19<br/>     - Root composer.json requires smarty/smarty, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 20<br/>     - Root composer.json requires stripe/stripe-php, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 21<br/>     - Root composer.json requires symfony/yaml, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 22<br/>     - Root composer.json requires telegram-bot/api, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 23<br/>     - Root composer.json requires voku/anti-xss, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 24<br/>     - Root composer.json requires zeuxisoo/slim-whoops, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 25<br/>     - Root composer.json requires guzzlehttp/guzzle, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 26<br/>     - Root composer.json requires symfony/console, it could not be found in any version, there may be a typo in the package name.<br/>   Problem 27<br/>     - Root composer.json requires nunomaduro/phpinsights, it could not be found in any version, there may be a typo in the package name.</p>\n<p>Potential causes:<br/>  - A typo in the package name<br/>  - The package is not available in a stable-enough version according to your minimum-stability setting<br/>    see &lt;https://getcomposer.org/doc/04-schema.md#minimum-stability&gt; for more details.<br/>  - It's a private package and you forgot to add a custom repository to find it</p>\n<p>Read &lt;https://getcomposer.org/doc/articles/troubleshooting.md&gt; for further common problems.</p>\n</blockquote>\n<p> 解决方法：</p>\n<p><span style=\"color:#ff9900;\"><strong>方法一：检查你运行 composer 的php版本是否是 7.4 版本。用 php 7.2 版本试试！！</strong></span></p>\n<p><span style=\"color:#ff9900;\"><strong>方法二：如果是用7.4版本，就按标准的写法：</strong></span></p>\n<blockquote>\n<p># 先更新源地址</p>\n<p>/www/server/php/74/bin/php composer.phar config repo.packagist composer https://mirrors.aliyun.com/composer/</p>\n<p># 标准写法</p>\n<p>/www/server/php/74/bin/php composer.phar install</p>\n<p>--- or ----</p>\n<p>/www/server/php/74/bin/php -d disable_functions=''  composer.phar require php-di/php-di -W</p>\n</blockquote>\n<p>上面就是我的解决方法，被坑了好久才找到的，如果你解决了，评论区留言告诉我！</p>\n<p>然后，你就快乐的等待着安装完成吧！！</p>\n<p><img alt=\"\" height=\"823\" src=\"image\\46bca30ab30245c2b4537e1cd523dc21.png\" width=\"869\"/></p>\n<p></p>\n</div>\n</div>"}