{"blogid": "126742368", "writerAge": "码龄6年", "writerBlogNum": "93", "writerCollect": "102", "writerComment": "37", "writerFan": "70", "writerGrade": "4级", "writerIntegral": "1306", "writerName": "零时科技", "writerProfileAdress": "writer_image\\profile_126742368.jpg", "writerRankTotal": "15874", "writerRankWeekly": "163441", "writerThumb": "14", "writerVisitNum": "86945", "blog_read_count": "11", "blog_time": "于 2022-09-07 11:34:59 发布", "blog_title": "零时科技创始人邓永凯先生受邀出席中国创交会之科创湾区创新论坛", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"style.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<p></p>\n<p>9月2日，零时科技创始人、区块链安全攻防专家邓永凯先生受邀参加由中国科协企业创新服务中心指导、广州市科学技术协会、中国创新创业成果交易会办公室主办、广州市人民政府港澳事务办公室支持、广州市穗港澳合作交流促进会承办的《2022中国创交会之科创湾区创新论坛》。本次会议在WMA元宇宙会议室举办，共计480余位业界专家及企业家代表和知名媒体、超10万观众通过元宇宙直播观看了论坛盛况。</p>\n<p></p>\n<p style=\"text-align:center;\"><img alt=\"\" src=\"image\\36c2ebe6580a4d0aa62e887f42506c50.png\"/></p>\n<p> </p>\n<p>会上，邓永凯先生与中国移动通信联合会区块链专委会副主任、清华大学客座教授陈朝晖、中民协元宇宙工委联席秘书长高泽龙、国富资本董事长、元宇宙与碳中和研究院院长熊焰、亚洲区块链学会会长蔡志川博士、香港一带一路科技金融协会執行会长唐仪、数字经济与元宇宙研究专家许金钢博士共同出席了“大湾区发展及创新创业发展机遇”主题圆桌，探讨元宇宙时代大湾区数字经济的发展机遇、创新创业优势、政策扶持及元宇宙中的基础设施和安全保障解决方案。</p>\n<p></p>\n<p style=\"text-align:center;\"><img alt=\"\" src=\"image\\92b8c896e78042029b0051c625d900b8.png\"/></p>\n<p> </p>\n<p>湾区科技创新发展，离不开政府、行业组织和企业家的共同建设。<strong>谈到大湾区数字经济发展机遇，邓永凯先生表示，数字经济是国家战略发展方向，在大湾区数字经济发展过程中，有很多发展机会。一方面是数字化基础设施的建设，另一方面是数字化转型升级。</strong></p>\n<p></p>\n<p>比如，在数据信息的采集、存储、交易、流通等方面，需要大量的信息基础设施和公共服务平台；要发展数字经济，就需要大量的行业和场景数字化，如公共与政务服务场景数字化，制造业场景数字化，行业大数据和云平台建设。除此外，生物医药大数据，跨境电商，物联网，工业互联网，车联网领域都需要进行数字化转型升级，让社会公众体验数字赋能生活。</p>\n<p></p>\n<p><strong>关于元宇宙时代大湾区创新创业优势方面，邓永凯先生认为，大湾区创新创业最大的优势就是开放包容的环境，以及龙头企业的强大辐射带动作用。</strong></p>\n<p>第一，湾区可借助广州和深圳的算力优势，建设公共服务大数据采集、开发和应用体系，建设大湾区国家算力枢纽。</p>\n<p>第二，可借助广州、深圳“中国软件名城”的辐射带动作用，加大关键核心技术研发，推进自主可控的操作系统、数据库、中间件等基础软件的发展，加快数字产品的创新和应用。</p>\n<p></p>\n<p>有了这些强大的信息技术和智能技术的基础，以及完整的技术供应链体系支持，这将是元宇宙时代湾区创业的最大优势。</p>\n<p></p>\n<p><strong>元宇宙作为近年创新创业的热点方向，其基础设施和场景应用天然具有大量的数据、信息和数字资产，安全方面面临着不容忽视的巨大挑战。对此，邓永凯先生表示，元宇宙的基础设施包含了从软件到硬件各个环节，如大数据、人工智能、移动互联网、云计算、物联网、区块链技术等</strong>。除此外，每一个场景中都有大量的数据采集、存储、交互、流通，这些数据信息是最宝贵的资产，所以保障这些数据资产的安全，也是一项很重要的工作，也可以是基础设施之一。</p>\n<p></p>\n<p><strong>关于从哪些方面保障元宇宙生态安全，邓永凯先生认为，从软件研发开始，就得有安全开发意识，安全开发生命周期，安全测试，代码审计等。</strong>要在应用平台上线前做完整的应用安全审计，网络系统的隔离划分，硬件服务器的安全加固，并且做好数据存储的灾备、分级、加密，运维工作人员的安全意识培训。运行中要定期进行渗透测试，做好风险监控预警，对新型攻击手段和0day漏洞的及时响应，对受影响的业务及时检测并更新，避免被黑客攻击。出现安全事故后，要能及时恢复业务，减少数据泄漏，减少资产损失，对安全事件进行复盘溯源，查漏补缺。在安全运营方面，也要加强非技术人员的安全意识培训，建立完善的安全管理制度。</p>\n<p></p>\n<p>元宇宙生态的发展离不开资本的赋能和政策的支持，关于大湾区应该给予什么样的资本政策支持来助力企业创新发展，邓永凯先生表示，希望可以建立健全的领导机制，完善的规划实施机制，促进区域合作。另外要构建“政产学研用投”一体化协同机制和开放包容合规监管的灵活机制。同时加大金融资本、人力资本对产业的投入，才能真正激发数字经济发展动力和活力。</p>\n<p></p>\n<p>据《中国元宇宙发展报告（2022）》蓝皮书，中国目前元宇宙产业产值已超400亿元，目前已经形成了完整的产业生态环境，包括共性能力层、场景应用层、基础设施层和应用系统层。</p>\n<p></p>\n<p>在新一轮科技革命与产业变革中，如何让这些数据、信息、场景应用的安全得到保障？零时科技凭借自身专业的技术实力和丰富的实战经验，作为一家专注于区块链安全的实战创新型网络安全企业，将充分调动团队十余年的一线网络攻防实战经验，结合大数据分析和人工智能技术，为元宇宙中的各项区块链基础设施及生态应用提供专业的安全审计服务、渗透测试、应急响应、威胁情报、加密资产追溯分析等全方位区块链安全解决方案，为元宇宙生态安全保驾护航！</p>\n<p></p>\n<p></p>\n</div>\n</div>"}