{"blogid": "126743181", "writerAge": "码龄39天", "writerBlogNum": "169", "writerCollect": "3", "writerComment": "1", "writerFan": "70", "writerGrade": "5级", "writerIntegral": "1860", "writerName": "幸福的小肥熊", "writerProfileAdress": "writer_image\\profile_126743181.jpg", "writerRankTotal": "14133", "writerRankWeekly": "9012", "writerThumb": "0", "writerVisitNum": "16331", "blog_read_count": "16", "blog_time": "于 2022-09-07 12:28:52 发布", "blog_title": "谈谈你对神经网络的理解,神经网络的原理和应用", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"style.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<h2>神经网络具体是什么？</h2>\n<p>神经网络由大量的神经元相互连接而成。每个神经元接受线性组合的输入后，最开始只是简单的线性加权，后来给每个神经元加上了非线性的激活函数，从而进行非线性变换后输出。</p>\n<p>每两个神经元之间的连接代表加权值，称之为权重（weight）。不同的权重和激活函数，则会导致神经网络不同的输出。举个手写识别的例子，给定一个未知数字，让神经网络识别是什么数字。</p>\n<p>此时的神经网络的输入由一组被输入图像的像素所激活的输入神经元所定义。在通过非线性激活函数进行非线性变换后，神经元被激活然后被传递到其他神经元。重复这一过程，直到最后一个输出神经元被激活。</p>\n<p>从而识别当前数字是什么字。</p>\n<p>神经网络的每个神经元如下基本wx+b的形式，其中x1、x2表示输入向量w1、w2为权重，几个输入则意味着有几个权重，即每个输入都被赋予一个权重b为偏置biasg(z)为激活函数a为输出如果只是上面这样一说，估计以前没接触过的十有八九又必定迷糊了。</p>\n<p>事实上，上述简单模型可以追溯到20世纪50/60年代的感知器，可以把感知器理解为一个根据不同因素、以及各个因素的重要性程度而做决策的模型。举个例子，这周末北京有一草莓音乐节，那去不去呢？</p>\n<p>决定你是否去有二个因素，这二个因素可以对应二个输入，分别用x1、x2表示。此外，这二个因素对做决策的影响程度不一样，各自的影响程度用权重w1、w2表示。</p>\n<p>一般来说，音乐节的演唱嘉宾会非常影响你去不去，唱得好的前提下即便没人陪同都可忍受，但如果唱得不好还不如你上台唱呢。所以，我们可以如下表示：x1：是否有喜欢的演唱嘉宾。</p>\n<p>x1=1你喜欢这些嘉宾，x1=0你不喜欢这些嘉宾。嘉宾因素的权重w1=7x2：是否有人陪你同去。x2=1有人陪你同去，x2=0没人陪你同去。</p>\n<p>是否有人陪同的权重w2=3。这样，咱们的决策模型便建立起来了：g(z)=g(w1x1+w2x2+b)，g表示激活函数，这里的b可以理解成为更好达到目标而做调整的偏置项。</p>\n<p>一开始为了简单，人们把激活函数定义成一个线性函数，即对于结果做一个线性变化，比如一个简单的线性激活函数是g(z)=z，输出都是输入的线性变换。</p>\n<p>后来实际应用中发现，线性激活函数太过局限，于是引入了非线性激活函数。</p>\n<p><strong>谷歌人工智能写作项目：神经网络伪原创</strong></p>\n<p><img alt=\"\" src=\"image\\1343ebe46ee142b89e7d10fa2aee3b80.png\"/></p>\n<h2>我这么理解神经网络对吗</h2>\n<h2>神经网络优缺点，</h2>\n<p>优点：（1）具有自学习功能。例如实现图像识别时，只在先把许多不同的图像样板和对应的应识别的结果输入人工神经网络，网络就会通过自学习功能，慢慢学会识别类似的图像。自学习功能对于预测有特别重要的意义。</p>\n<p>预期未来的人工神经网络计算机将为人类提供经济预测、市场预测、效益预测，其应用前途是很远大的。（2）具有联想存储功能。用人工神经网络的反馈网络就可以实现这种联想。（3）具有高速寻找优化解的能力。</p>\n<p>寻找一个复杂问题的优化解，往往需要很大的计算量，利用一个针对某问题而设计的反馈型人工神经网络，发挥计算机的高速运算能力，可能很快找到优化解。</p>\n<p>缺点：（1）最严重的问题是没能力来解释自己的推理过程和推理依据。（2）不能向用户提出必要的询问，而且当数据不充分的时候，神经网络就无法进行工作。</p>\n<p>（3）把一切问题的特征都变为数字，把一切推理都变为数值计算，其结果势必是丢失信息。（4）理论和学习算法还有待于进一步完善和提高。</p>\n<p>扩展资料：神经网络发展趋势人工神经网络特有的非线性适应性信息处理能力，克服了传统人工智能方法对于直觉，如模式、语音识别、非结构化信息处理方面的缺陷，使之在神经专家系统、模式识别、智能控制、组合优化、预测等领域得到成功应用。</p>\n<p>人工神经网络与其它传统方法相结合，将推动人工智能和信息处理技术不断发展。</p>\n<p>近年来，人工神经网络正向模拟人类认知的道路上更加深入发展，与模糊系统、遗传算法、进化机制等结合，形成计算智能，成为人工智能的一个重要方向，将在实际应用中得到发展。</p>\n<p>将信息几何应用于人工神经网络的研究，为人工神经网络的理论研究开辟了新的途径。神经计算机的研究发展很快，已有产品进入市场。光电结合的神经计算机为人工神经网络的发展提供了良好条件。</p>\n<p>神经网络在很多领域已得到了很好的应用，但其需要研究的方面还很多。</p>\n<p>其中，具有分布存储、并行处理、自学习、自组织以及非线性映射等优点的神经网络与其他技术的结合以及由此而来的混合方法和混合系统，已经成为一大研究热点。</p>\n<p>由于其他方法也有它们各自的优点，所以将神经网络与其他方法相结合，取长补短，继而可以获得更好的应用效果。</p>\n<p>目前这方面工作有神经网络与模糊逻辑、专家系统、遗传算法、小波分析、混沌、粗集理论、分形理论、证据理论和灰色系统等的融合。参考资料：百度百科-人工神经网络。</p>\n<h2>什么叫神经网络？</h2>\n<p>南搞小孩给出基本的概念:一.一些基本常识和原理[什么叫神经网络?]人的思维有逻辑性和直观性两种不同的基本方式。</p>\n<p>逻辑性的思维是指根据逻辑规则进行推理的过程；它先将信息化成概念，并用符号表示，然后，根据符号运算按串行模式进行逻辑推理；这一过程可以写成串行的指令，让计算机执行。</p>\n<p>然而，直观性的思维是将分布式存储的信息综合起来，结果是忽然间产生想法或解决问题的办法。</p>\n<p>这种思维方式的根本之点在于以下两点:1.信息是通过神经元上的兴奋模式分布储在网络上;2.信息处理是通过神经元之间同时相互作用的动态过程来完成的。人工神经网络就是模拟人思维的第二种方式。</p>\n<p>这是一个非线性动力学系统，其特色在于信息的分布式存储和并行协同处理。虽然单个神经元的结构极其简单，功能有限，但大量神经元构成的网络系统所能实现的行为却是极其丰富多彩的。</p>\n<p>[人工神经网络的工作原理]人工神经网络首先要以一定的学习准则进行学习，然后才能工作。</p>\n<p>现以人工神经网络对手写“A”、“B”两个字母的识别为例进行说明，规定当“A”输入网络时，应该输出“1”，而当输入为“B”时，输出为“0”。</p>\n<p>所以网络学习的准则应该是：如果网络作出错误的的判决，则通过网络的学习，应使得网络减少下次犯同样错误的可能性。</p>\n<p>首先，给网络的各连接权值赋予(0，1)区间内的随机值，将“A”所对应的图象模式输入给网络，网络将输入模式加权求和、与门限比较、再进行非线性运算，得到网络的输出。</p>\n<p>在此情况下，网络输出为“1”和“0”的概率各为50%，也就是说是完全随机的。这时如果输出为“1”(结果正确)，则使连接权值增大，以便使网络再次遇到“A”模式输入时，仍然能作出正确的判断。</p>\n<p>如果输出为“0”(即结果错误)，则把网络连接权值朝着减小综合输入加权值的方向调整，其目的在于使网络下次再遇到“A”模式输入时，减小犯同样错误的可能性。</p>\n<p>如此操作调整，当给网络轮番输入若干个手写字母“A”、“B”后，经过网络按以上学习方法进行若干次学习后，网络判断的正确率将大大提高。</p>\n<p>这说明网络对这两个模式的学习已经获得了成功，它已将这两个模式分布地记忆在网络的各个连接权值上。当网络再次遇到其中任何一个模式时，能够作出迅速、准确的判断和识别。</p>\n<p>一般说来，网络中所含的神经元个数越多，则它能记忆、识别的模式也就越多。</p>\n<p>南搞小孩一个小程序:关于一个神经网络模拟程序的下载人工神经网络实验系统(BP网络)V1.0Beta作者:沈琦作者关于此程序的说明:从输出结果可以看到，前3条\"学习\"指令，使\"输出\"神经元收敛到了值0.515974。</p>\n<p>而后3条\"学习\"指令，其收敛到了值0.520051。再看看处理4和11的指令结果P*Out1:0.520051看到了吗？\"大脑\"识别出了4和11是属于第二类的！</p>\n<p>怎么样?很神奇吧?再打show指令看看吧!\"神经网络\"已经形成了!你可以自己任意的设\"模式\"让这个\"大脑\"学习分辩哦!只要样本数据量充分(可含有误差的样本)，如果能够在out数据上收敛地话，那它就能分辨地很准哦!有时不是绝对精确，因为它具有\"模糊处理\"的特性.看Process输出的值接近哪个Learning的值就是\"大脑\"作出的\"模糊性\"判别!南搞小孩神经网络研究社区:人工神经网络论坛(旧版,枫舞推荐)国际神经网络学会(INNS)(英文)欧洲神经网络学会(ENNS)(英文)亚太神经网络学会(APNNA)(英文)日本神经网络学会(JNNS)(日文)国际电气工程师协会神经网络分会研学论坛神经网络;sty=1&amp;age=0人工智能研究者俱乐部2nsoft人工神经网络中文站=南搞小孩推荐部分书籍:人工神经网络技术入门讲稿(PDF)神经网络FAQ(英文)数字神经网络系统(电子图书)神经网络导论(英文)=南搞小孩还找到一份很有参考价值的讲座是Powerpoint文件，比较大，如果网速不够最好用鼠标右键下载另存.南搞小孩添言:很久之前，枫舞梦想智能机器人从自己手中诞生,SO在学专业的时候也有往这方面发展...考研的时候亦是朝着人工智能的方向发展..但是很不幸的是枫舞考研失败只好放弃这个美好的愿望,为生活奔波.希望你能够成为一个好的智能计算机工程师..枫舞已经努力的在给你提供条件资源哦~~。</p>\n<h2>人工神经网络的定义，详细说明</h2>\n<p>人工神经网络（ArtificialNeuralNetworks,ANN），一种模范动物神经网络行为特征，进行分布式并行信息处理的算法数学模型。</p>\n<p>这种网络依靠系统的复杂程度，通过调整内部大量节点之间相互连接的关系，从而达到处理信息的目的。</p>\n<p>人工神经网络具有自学习和自适应的能力，可以通过预先提供的一批相互对应的输入－输出数据，分析掌握两者之间潜在的规律，最终根据这些规律，用新的输入数据来推算输出结果，这种学习分析的过程被称为“训练”。</p>\n<p>（引自《环球科学》2007年第一期《神经语言：老鼠胡须下的秘密》）概念由大量处理单元互联组成的非线性、自适应信息处理系统。</p>\n<p>它是在现代神经科学研究成果的基础上提出的，试图通过模拟大脑神经网络处理、记忆信息的方式进行信息处理。人工神经网络具有四个基本特征：（1）非线性非线性关系是自然界的普遍特性。</p>\n<p>大脑的智慧就是一种非线性现象。人工神经元处于激活或抑制二种不同的状态，这种行为在数学上表现为一种非线性关系。具有阈值的神经元构成的网络具有更好的性能，可以提高容错性和存储容量。</p>\n<p>（2）非局限性一个神经网络通常由多个神经元广泛连接而成。一个系统的整体行为不仅取决于单个神经元的特征，而且可能主要由单元之间的相互作用、相互连接所决定。通过单元之间的大量连接模拟大脑的非局限性。</p>\n<p>联想记忆是非局限性的典型例子。（3）非常定性人工神经网络具有自适应、自组织、自学习能力。神经网络不但处理的信息可以有各种变化，而且在处理信息的同时，非线性动力系统本身也在不断变化。</p>\n<p>经常采用迭代过程描写动力系统的演化过程。（4）非凸性一个系统的演化方向，在一定条件下将取决于某个特定的状态函数。例如能量函数，它的极值相应于系统比较稳定的状态。</p>\n<p>非凸性是指这种函数有多个极值，故系统具有多个较稳定的平衡态，这将导致系统演化的多样性。人工神经网络中，神经元处理单元可表示不同的对象，例如特征、字母、概念，或者一些有意义的抽象模式。</p>\n<p>网络中处理单元的类型分为三类：输入单元、输出单元和隐单元。输入单元接受外部世界的信号与数据；输出单元实现系统处理结果的输出；隐单元是处在输入和输出单元之间，不能由系统外部观察的单元。</p>\n<p>神经元间的连接权值反映了单元间的连接强度，信息的表示和处理体现在网络处理单元的连接关系中。</p>\n<p>人工神经网络是一种非程序化、适应性、大脑风格的信息处理，其本质是通过网络的变换和动力学行为得到一种并行分布式的信息处理功能，并在不同程度和层次上模仿人脑神经系统的信息处理功能。</p>\n<p>它是涉及神经科学、思维科学、人工智能、计算机科学等多个领域的交叉学科。</p>\n<p>人工神经网络是并行分布式系统，采用了与传统人工智能和信息处理技术完全不同的机理，克服了传统的基于逻辑符号的人工智能在处理直觉、非结构化信息方面的缺陷，具有自适应、自组织和实时学习的特点。</p>\n<p>历史沿革1943年，心理学家W.S.McCulloch和数理逻辑学家W.Pitts建立了神经网络和数学模型，称为MP模型。</p>\n<p>他们通过MP模型提出了神经元的形式化数学描述和网络结构方法，证明了单个神经元能执行逻辑功能，从而开创了人工神经网络研究的时代。1949年，心理学家提出了突触联系强度可变的设想。</p>\n<p>60年代，人工神经网络的到了进一步发展，更完善的神经网络模型被提出，其中包括感知器和自适应线性元件等。</p>\n<p>M.Minsky等仔细分析了以感知器为代表的神经网络系统的功能及局限后，于1969年出版了《Perceptron》一书，指出感知器不能解决高阶谓词问题。</p>\n<p>他们的论点极大地影响了神经网络的研究，加之当时串行计算机和人工智能所取得的成就，掩盖了发展新型计算机和人工智能新途径的必要性和迫切性，使人工神经网络的研究处于低潮。</p>\n<p>在此期间，一些人工神经网络的研究者仍然致力于这一研究，提出了适应谐振理论（ART网）、自组织映射、认知机网络，同时进行了神经网络数学理论的研究。以上研究为神经网络的研究和发展奠定了基础。</p>\n<p>1982年，美国加州工学院物理学家J.J.Hopfield提出了Hopfield神经网格模型，引入了“计算能量”概念，给出了网络稳定性判断。</p>\n<p>1984年，他又提出了连续时间Hopfield神经网络模型，为神经计算机的研究做了开拓性的工作，开创了神经网络用于联想记忆和优化计算的新途径，有力地推动了神经网络的研究，1985年，又有学者提出了波耳兹曼模型，在学习中采用统计热力学模拟退火技术，保证整个系统趋于全局稳定点。</p>\n<p>1986年进行认知微观结构地研究，提出了并行分布处理的理论。</p>\n<p>人工神经网络的研究受到了各个发达国家的重视，美国国会通过决议将1990年1月5日开始的十年定为“脑的十年”，国际研究组织号召它的成员国将“脑的十年”变为全球行为。</p>\n<p>在日本的“真实世界计算（RWC）”项目中，人工智能的研究成了一个重要的组成部分。基本内容人工神经网络模型主要考虑网络连接的拓扑结构、神经元的特征、学习规则等。</p>\n<p>目前，已有近40种神经网络模型，其中有反传网络、感知器、自组织映射、Hopfield网络、波耳兹曼机、适应谐振理论等。</p>\n<p>根据连接的拓扑结构，神经网络模型可以分为：（1）前向网络网络中各个神经元接受前一级的输入，并输出到下一级，网络中没有反馈，可以用一个有向无环路图表示。</p>\n<p>这种网络实现信号从输入空间到输出空间的变换，它的信息处理能力来自于简单非线性函数的多次复合。网络结构简单，易于实现。反传网络是一种典型的前向网络。</p>\n<p>（2）反馈网络网络内神经元间有反馈，可以用一个无向的完备图表示。这种神经网络的信息处理是状态的变换，可以用动力学系统理论处理。系统的稳定性与联想记忆功能有密切关系。</p>\n<p>Hopfield网络、波耳兹曼机均属于这种类型。学习是神经网络研究的一个重要内容，它的适应性是通过学习实现的。根据环境的变化，对权值进行调整，改善系统的行为。</p>\n<p>由Hebb提出的Hebb学习规则为神经网络的学习算法奠定了基础。Hebb规则认为学习过程最终发生在神经元之间的突触部位，突触的联系强度随着突触前后神经元的活动而变化。</p>\n<p>在此基础上，人们提出了各种学习规则和算法，以适应不同网络模型的需要。</p>\n<p>有效的学习算法，使得神经网络能够通过连接权值的调整，构造客观世界的内在表示，形成具有特色的信息处理方法，信息存储和处理体现在网络的连接中。</p>\n<p>根据学习环境不同，神经网络的学习方式可分为监督学习和非监督学习。</p>\n<p>在监督学习中，将训练样本的数据加到网络输入端，同时将相应的期望输出与网络输出相比较，得到误差信号，以此控制权值连接强度的调整，经多次训练后收敛到一个确定的权值。</p>\n<p>当样本情况发生变化时，经学习可以修改权值以适应新的环境。使用监督学习的神经网络模型有反传网络、感知器等。非监督学习时，事先不给定标准样本，直接将网络置于环境之中，学习阶段与工作阶段成为一体。</p>\n<p>此时，学习规律的变化服从连接权值的演变方程。非监督学习最简单的例子是Hebb学习规则。竞争学习规则是一个更复杂的非监督学习的例子，它是根据已建立的聚类进行权值调整。</p>\n<p>自组织映射、适应谐振理论网络等都是与竞争学习有关的典型模型。</p>\n<p>研究神经网络的非线性动力学性质，主要采用动力学系统理论、非线性规划理论和统计理论，来分析神经网络的演化过程和吸引子的性质，探索神经网络的协同行为和集体计算功能，了解神经信息处理机制。</p>\n<p>为了探讨神经网络在整体性和模糊性方面处理信息的可能，混沌理论的概念和方法将会发挥作用。混沌是一个相当难以精确定义的数学概念。</p>\n<p>一般而言，“混沌”是指由确定性方程描述的动力学系统中表现出的非确定性行为，或称之为确定的随机性。</p>\n<p>“确定性”是因为它由内在的原因而不是外来的噪声或干扰所产生，而“随机性”是指其不规则的、不能预测的行为，只可能用统计的方法描述。</p>\n<p>混沌动力学系统的主要特征是其状态对初始条件的灵敏依赖性，混沌反映其内在的随机性。</p>\n<p>混沌理论是指描述具有混沌行为的非线性动力学系统的基本理论、概念、方法，它把动力学系统的复杂行为理解为其自身与其在同外界进行物质、能量和信息交换过程中内在的有结构的行为，而不是外来的和偶然的行为，混沌状态是一种定态。</p>\n<p>混沌动力学系统的定态包括：静止、平稳量、周期性、准同期性和混沌解。混沌轨线是整体上稳定与局部不稳定相结合的结果，称之为奇异吸引子。</p>\n<p>一个奇异吸引子有如下一些特征：（1）奇异吸引子是一个吸引子，但它既不是不动点，也不是周期解；（2）奇异吸引子是不可分割的，即不能分为两个以及两个以上的吸引子；（3）它对初始值十分敏感，不同的初始值会导致极不相同的行为。</p>\n<p>发展趋势人工神经网络特有的非线性适应性信息处理能力，克服了传统人工智能方法对于直觉，如模式、语音识别、非结构化信息处理方面的缺陷，使之在神经专家系统、模式识别、智能控制、组合优化、预测等领域得到成功应用。</p>\n<p>人工神经网络与其它传统方法相结合，将推动人工智能和信息处理技术不断发展。</p>\n<p>近年来，人工神经网络正向模拟人类认知的道路上更加深入发展，与模糊系统、遗传算法、进化机制等结合，形成计算智能，成为人工智能的一个重要方向，将在实际应用中得到发展。</p>\n<p>将信息几何应用于人工神经网络的研究，为人工神经网络的理论研究开辟了新的途径。神经计算机的研究发展很快，已有产品进入市场。光电结合的神经计算机为人工神经网络的发展提供了良好条件。</p>\n<h2>如何正确理解神经网络在NLP领域的运用</h2>\n<p>opinionextractionsystem这说法很学术，我不知道中文怎么表达。informationretrievalsystem指的就搜索引擎。</p>\n<p>首先，基于文本相关性来搜索，在NLP场景下，核心关键词的得分容易被一些废话稀释。虽然可以用stopwords来解决，但句法分析提取本体的做法会精准得多。</p>\n<p>然后，更重要的是，咱们搞搜索上层应用的，除了文本相关性之外，很多时候会做一些基于特定规则的特殊处理。这一块很大程度是基于自身的业务，所以国内LTP也好、ICTCLAS也好，并没有给出做句法分析的通解。</p>\n<p>例如一个视频搜索，发现query里有“new”或者“hot”，可能就要在搜索时加上时间相关的特殊规则。这些规则的制定，就是对业务的理解结合句法分析完成的。</p>\n<p>视频搜索这例子不太好，因为设个关键词也能解决，不需要用到句法分析这种牛刀。如果搜“我要订个明天从广州飞北京的机票”，就一定要用句法分析了。</p>\n<p>首先要判定这个是买机票业务，然后抽取出句中的时间地点，然后填入对应的业务接口当中，最后呈现给用户。其难点在于如何抽象化和运行效率问题，还有业务和工程方面无数你想到的想不到的坑。</p>\n<p> </p>\n</div>\n</div>"}