{"blogid": "126743816", "writerAge": "码龄32天", "writerBlogNum": "138", "writerCollect": "8", "writerComment": "3", "writerFan": "477", "writerGrade": "4级", "writerIntegral": "1581", "writerName": "ai智能网络", "writerProfileAdress": "..\\..\\static\\writer_image\\profile_126743816.jpg", "writerRankTotal": "14581", "writerRankWeekly": "2839", "writerThumb": "7", "writerVisitNum": "11916", "blog_read_count": "15", "blog_time": "于 2022-09-07 13:28:27 发布", "blog_title": "邱锡鹏神经网络怎么样,邱锡鹏神经网络答案", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"../../static/bootstrap/css/csdnstyle.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<h2>什么是离散型神经网络</h2>\n<p>近年来离散型时滞神经网络的稳定性一直是人们研究的热点问题。考虑到在网络中信号从一点传送到另一点可能要经过很多网络段，而不同的网络段一般有不同的传输条件，这就导致多个加性时滞。</p>\n<p>研究多个加性时滞的离散型神经网络的稳定性具有重要的理论意义和实际价值。对于这类神经网络，本文以两个加性时滞为例首先研究了确定参数情况下的全局指数稳定性问题。</p>\n<p>利用Lyapunov稳定性理论和线性矩阵不等式方法，得到了这类神经网络全局指数稳定性条件。该条件保守性小而易于检验。</p>\n<p>当参数不确定时，对于两个加性时滞的离散神经网络研究了鲁棒渐近稳定性问题，得到了这类不确定神经网络鲁棒渐近稳定的新条件。</p>\n<p>最后，对于确定参数情况下的稳定性结果，本文进行了改进而得到了简洁而保守性小的稳定性判据。论文按以下结构进行组织：第一章介绍了多个加性时滞离散神经网络稳定性的研究背景，在此基础上提出了本文的研究问题。</p>\n<p>第二章介绍了本文所需的预备知识，包括李亚普诺夫稳定性理论和不等式定理等。第三章研究了确定参数情况下的带两个加性时滞离散神经网络的全局指数稳定性问题。</p>\n<p>通过构造Lyapunov-Krasovskii泛函，利用自由权值矩阵方法处理该Lyapunov-Krasovskii泛函的差分，得到了这类神经网络全局指数稳定性结果。</p>\n<p>所得稳定性条件可方便地使用MATLAB中的LMI工具箱检验。第四章对范数有界参数不确定情况下的带两个加性时滞离散神经网络，研究了鲁棒渐近稳定性问题。</p>\n<p>采用李亚普诺夫函数方法，得到了这类不确定神经网络的鲁棒渐近稳定性判据，进一步举例说明了该判据的有效性。第五章对于第三章所得结果进行了改进。</p>\n<p>通过构造新的Lyapunov-Krasovskii泛函，应用一种新技术计算该Lyapunov-Krasovskii泛函的差分，得到了新的稳定性结果。</p>\n<p>所得稳定性结果涉及的矩阵变量少，而且具有较小的保守性。第六章是全文总结，并指出了下一步要研究的问题。</p>\n<p><strong>谷歌人工智能写作项目：神经网络伪原创</strong></p>\n<p><img alt=\"\" src=\"..\\..\\static\\image\\1343ebe46ee142b89e7d10fa2aee3b80.png\"/></p>\n<h2>跪求关于“岩土工程”的毕业论文？</h2>\n<p>摘要：本文简要论述了环境岩土工程的定义，环境岩土工程中的基本观点以及以及环境岩土工程的研究现状，并对我国环境岩土工程进行了展望<strong><a href=\"http://www.maoxiezuo.com/\" title=\"写作猫\">写作猫</a></strong>。</p>\n<p>关键词：环境岩土工程研究随着和、的迅速，人们越来越意识到人类活动对环境产生的两个负面：环境污染和生态破坏。因此，应运产生了一门新兴学科——环境岩土工程学。</p>\n<p>它既是一门性的工程学，又是一门学。它把技术和、经济和文化相结合的跨学科的新型学科。</p>\n<p>1.环境岩土工程定义环境岩土工程（EnvironmentalGeotechnology）一词，源自1986年4月美国宾州里海大学土木系美籍华人方晓阳教授主持召开的第一届环境岩土工程国际学术研讨会，并在其著名的“IntroductoryRemarksonEnvironmentalGeotechnology”论文中，将环境岩土工程定位为“跨学科的边缘，覆盖了在大气圈、生物圈、水圈、岩石圈及地质微生物圈等多种环境下土和岩石及其相互作用的”，主要是研究在不同环境周期（循环）作用下水土系统的工程性质。</p>\n<p>2.环境岩土工程研究的及分类环境岩土工程是研究应用岩土工程的概念进行环境保护的一门学科。这是一门跨学科的边缘学科，涉及面很广，包括：气象、水文、地质、农业、化学、医学、工程学等等。</p>\n<p>环境岩土工程研究的内容大致可以分为三类：(1)环境工程。主要指用岩土工程的方法来抵御由于天灾引起的环境问题。例如：抗沙漠化、洪水、滑坡、泥石流、地震、海啸等。这些问题通常泛指为大环境问题。</p>\n<p>(2)环境卫生工程。主要指用岩土工程的方法抵御由于各种化学污染引起的环境问题。例如城市各种废弃物的处理、污泥的处理等。(3)人类工程活动引起的一些环境问题。</p>\n<p>例如在密集的建筑群中打桩时，由于挤土、振动、噪声等对周围居住环境的影响；深基坑开挖时，降水和边坡位移等。</p>\n<p>3.环境岩土工程研究中基本观点及研究方法补充：3.1基本观点(1)岩土实践的范围是地球表层,而地球对于宇宙来讲是一个子系统,它的变化受其他子系统的影响,它们之间有物质和能量的交换,是一个开放的系统;(2)资源是有限的。</p>\n<p>我们只有一个地球,并且随着人口的增长,资源与人口相比越来越小,所以我们应实施可持续发展战略,而不能盲目地掠夺式地利用,以防止对环境造成不利的影响;(3)人类无计划的活动会毁灭人类自身;(4)界在不断地变化,有一些直接危害人类,反过来人类要避开危害,就必须采取措施;(5)虽然岩土工程曾带来一些消极影响,但它是由于人类认识上的片面性和的局限性造成的,所以从上讲,所有的环境岩土工程问题是可以解决的,但它依赖于人们环境意识的提高,岩土工程技术的进步和法制建设的健全。</p>\n<p>3.2研究方法环境岩土工程是一个系统工程。它涉及许多学科领域,所以在研究中应从学科间的交叉处着眼,以辩证的观点和解决问题。</p>\n<p>其次,应用岩土工程的观点去改善环境,使其更符合人类的生存需求。</p>\n<p>4.环境岩土工程与相关学科的关系与环境岩土工程相关的学科有:工程地质学、岩土力学、岩土工程学、地质工程、环境工程地质学。</p>\n<p>工程地质学的基础理论是地质学,指导它的理论主要是自然历史观1它的基本理论是认为地质成因和演化过程决定地质体的工程特性,相应地在研究方法上就是从地质体局部特性的研究,探索地质体在生成时的地质环境以及形成地质体的地质作用和演化过程,从而在整体上认识和把握地质体的组成和结构以及发育,并进一步探讨和预测它在工程建筑物作用下的表现和工程行为。</p>\n<p>工程地质学的服务对象完全是人为设计,人为施工的建物。这一应用性决定了工程地质学的边缘性、交叉性和综合性等特性。所谓边缘性指它处在地质学科的外层,位于和工程学科接壤的部位。</p>\n<p>所谓交叉性表明在它的学科发展中不断吸收工程学科的理论、概念和方法,并和地质学结合起来。</p>\n<p>所谓综合性是指工程地质学的目标是解决问题,它是借助于地质学各基础学科的成就来综合地工作的.补充：岩土力学、岩土工程和工程地质学在研究对象和目标上有很大的相同之处,是密切相邻的学科。</p>\n<p>但是岩土力学属于力学学科的边缘,而岩土工程属于工程学科的边缘1虽然对岩土的地质认识是建立岩土力学模型和本构关系的重要基础,但岩土力学更偏于模型及建模后的力学研究。</p>\n<p>岩土工程是将岩土作为工程结构物的一部分工程学科。不过岩土力学和岩土工程与其他的力学或工程学科相比,需要更多地质学科的支持,或者说更需要与地质学科的结合。</p>\n<p>5.环境岩土工程的研究现状20世纪50-60年代公害事件的显现，人们不断探索，反思，并已取得了基本的共识。</p>\n<p>国外对环境岩土工程的研究主要集中于垃圾土、污染土的性质、理论与控制等方面，而国内则在此基础上有较大的扩展，就目前涉及的问题来分，可以归纳为两大类：第一类是人类与自然环境之间的共同作用问题。</p>\n<p>这类问题的动因主要是由自然灾变引起的。例如地震灾害、土壤退化、洪水灾害、温室效应等。这些问题通常称为大环境问题。第二类是人类的生活、生产和工程活动与环境之间的共同作用问题。</p>\n<p>它的动因主要是人类自身。</p>\n<p>例如城市垃圾、工业生产中的废水、废液、废渣等有毒有害废弃物对生态环境的危害；工程建设活动如打桩、强夯、基坑开挖、盾构施工对周围环境的影响；过量抽汲地下水引起的地面沉降等等。</p>\n<p>有关这方面的问题，统称为小环境问题。6.环境岩土工程的展望20世纪90年代后，我国进入了大规模工程建设时期。</p>\n<p>从沿海地区开始，逐步向内陆扩展，高层建筑、地铁、道路、隧道等等的建设以及城市化进程步伐的加快向环境岩土工程不断提出新的挑战。</p>\n<p>同时，环境的变化，地震、洪涝灾害的频频发生，温室效应的加剧，水土流失，土壤退化等大环境，也引发了一系列新的环境岩土工程问题。相对发达国家来说，我国的岩土工程工作者面临更为艰巨的任务。</p>\n<p>一方面，我国正处于大规模工程建设时期，有许多工程问题需要解决;另一方面，基于可持续发展要求，我们面临严峻的环境保护与治理工作。在环境岩土工程问题上，未来几年应重点并解决下面几个问题。</p>\n<p>其中，西部问题，包括生态环境建设与保护区域稳定性与地下工程。东部问题，包括大城市地面变形不稳定性、悬河化水资源、水环境等。</p>\n<p>在一些方面还急需解决的问题如下：卫生填埋场的设计问题;大规模工程建设的区域环境岩土工程问题评估;城市施工环境岩土工程问题;岩土工程手段在环境的治理中的应用等。补充：具体是这样了自己慢慢看把。</p>\n<p> </p>\n</div>\n</div>", "first_tag": "Others", "cpp": 0, "csharp": 0, "python": 0, "javascript": 0, "java": 0, "sql": 0, "php": 0, "time": "2022-09-07 13:28:27", "summary": "什么是离散型神经网络近年来离散型时滞神经网络的稳定性一直是人们研究的热点问题。考虑到在网络中信号从一点传送到另一点可能要经过很多网络段，而不同的网络段一般有不同的传输条件，这就导致多个加性时滞。研究多"}