{"blogid": "126743600", "writerAge": "码龄39天", "writerBlogNum": "150", "writerCollect": "12", "writerComment": "5", "writerFan": "135", "writerGrade": "5级", "writerIntegral": "1613", "writerName": "快乐的小蓝猫", "writerProfileAdress": "..\\..\\static\\writer_image\\profile_126743600.jpg", "writerRankTotal": "14785", "writerRankWeekly": "5967", "writerThumb": "7", "writerVisitNum": "12729", "blog_read_count": "9", "blog_time": "于 2022-09-07 13:12:40 发布", "blog_title": "具有网状神经系统的动物,动物学网状神经系统图", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"../../static/bootstrap/css/csdnstyle.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<h2>动物的神经系统是怎样构造的？</h2>\n<p>动物的神经系统：指人和多细胞动物体内调节务器官的活动和适应外界环境的全部神经装置。主要由神经细胞即神经元组成。</p>\n<p>低等动物如水螅，神经系统是一个简单的网络，称网状神经系；涡虫等扁形动物为梯状神经系；环节、节肢动物为链状神经系；脊索动物为管状神经系。</p>\n<p>人和高等动物的神经系统复杂，包括中枢神经系统、周围神经系统和感觉器官三大部分。其中枢神经系统又分为脑髓和脊髓两部分。周围神经系统包括从脑和脊髓发出并分散到全身的神经以及植物性神经系统。</p>\n<p>脊椎动物的感觉器官可分为感受物理刺激和化学刺激的两大类。前者有皮肤感觉器、侧线器、平衡器、听觉器、视觉器，化学感受器有味觉器和嗅觉器。</p>\n<p><strong>谷歌人工智能写作项目：神经网络伪原创</strong></p>\n<p><img alt=\"\" src=\"..\\..\\static\\image\\1343ebe46ee142b89e7d10fa2aee3b80.png\"/></p>\n<h2>无脊椎动物的神经系统的发育</h2>\n<p><strong><a href=\"http://www.hwenan.com/\" title=\"好文案\">好文案</a></strong>。</p>\n<p>无脊椎动物的神经系统发育:由原始的原生动物:由于为单细胞动物,因此无组织系统分化,无神经系统;多孔动物(海绵):仍然无组织系统分化，但是在皮层中埋藏的芒状细胞被普遍认为是神经元的前体，或是神经元的原始形态。</p>\n<p>腔肠动物：网状神经系统。动物发展史中第一次出现的神经系统。特点是无方向性、无中枢、传导慢。一旦被外界刺激会引起全身收缩。扁形动物：梯状神经系统。</p>\n<p>神经系统因身体体制从辐射对称向两侧对称变化而逐渐有整合，部分神经元聚集形成神经结。有初步的中枢，有方向性。原腔动物：圆筒状神经系统。由围口神经发出的六条神经索（2条侧神经2条背神经2条腹神经）。</p>\n<p>但因原腔动物大多营内寄生生活，故神经系统退化。环节动物之后：索状神经系统。因为出现了身体分节、分部现象，从而使身体各部分的职能更加特化与分明。</p>\n<p>因此，神经系统在头部逐渐发育出脑神经节（实心、无脑室），在身体每部分都有以神经节，形成索状的中枢系统。</p>\n<h2>水螅河蚌神经系统分别为</h2>\n<h2>腔肠动物有哪些主要特征，它比多孔动物有哪些进步特征</h2>\n<p>1.腔肠动物的主要特征是：一、辐射对称腔肠动物的身体已有固定的形状，且辐射对称，即通过身体的中轴有许多切面将身体分成对称的两半。只有口面和反口面之分。</p>\n<p>有些种类通过中轴只有两个切面，将身体分成相等的两半，称两辐射对称，如海葵。这是介于辐射对称和两侧对称之间的一种形式。</p>\n<p>二、两胚层及原始的消化腔腔肠动物是具有真正的内外两胚层动物，在两胚层之间有由内外胚层细胞分泌的中胶层。</p>\n<p>体内的空腔即原肠腔，有细胞外消化的机能，残渣由口排出，所以又称为消化循环腔，或称腔肠，腔肠动物由此而得名。三、细胞和组织分化腔肠动物的细胞已分化为皮肌细胞、腺细胞、间细胞、刺细胞、感觉细胞等。</p>\n<p>皮肌细胞是内外胚层中的主要细胞，可执行上皮与肌肉的生理机能，故称皮肌细胞，这也表明腔肠动物开始有了原始的上皮与肌肉组织。</p>\n<p>皮肌细胞的基部延伸出一个或几个细长的突起，其中有肌原纤维分布，其成分和收缩机理与高等动物相似。四、网状神经系统从腔肠动物开始出现神经系统。神经细胞彼此以神经突起相联而成网状，所以称为网状神经系统。</p>\n<p>神经细胞与内外胚层中的感觉细胞、皮肌细胞相连，对外界的各种刺激产生有效的反应，但没有神经中枢。神经传导一般没有固定的方向，因此称为分散性神经系统。</p>\n<p>腔肠动物没有呼吸与排泄器官，主要依靠细胞表面从水中获得氧气并把二氧化碳等废物直接排入水中，或者排入消化循环腔内，由口排出。</p>\n<p>五、具水螅型，水母型两种基本形态水螅型营固着生活，体呈圆筒状，固着端称基盘，另一端为摄食的口，周围有触手，中胶层薄。珊瑚纲的水螅型，体壁的外胚层可分泌石灰质的外骨骼。</p>\n<p>水母型营漂浮生活，体呈圆盘状，突出的一面称外伞，凹入的一面称下伞，其中央悬挂着一条垂管，管的末端是口，由口通入消化循环腔和分枝状的辐管，并一直通到伞的边缘连接环管，伞的边缘有触手和感觉器管（平衡囊、触手囊）。</p>\n<p>水螅水母由下伞边缘向中央伸展一圈薄膜，称缘膜。六、生殖方法有无性生殖和有性生殖两种。无性生殖常以出芽方式形成群体。</p>\n<p>有性生殖多为雌雄异体，水螅纲的生殖腺由外胚层形成，但钵水母纲和珊瑚纲的生殖腺却来自内胚层，生殖细胞由间细胞而来。海产种类在胚胎发育过程中有浮浪幼虫期。</p>\n<p>2.腔肠动物较之多孔动物的进步特征：腔肠动物是低等的多细胞后生动物，较多细胞的侧生动物——多孔动物已有明显得的进化：（1）细胞有了更明显的工，具有原始的肌肉组织和神经系，表明这类动物已由细胞级发展到组织级阶段；（2）在系统发生上，它已由单细胞原生动物跨进具有真正的二胚层的后生动物的行列。</p>\n<p>这在动物进化史上是一次重大的飞跃。</p>\n<h2>从不同动物的神经系统,谈谈动物进化趋势</h2>\n<p>1）神经系统指由神经元构成的一个异常复杂的机能系统，它的进化经历了网状神经系统、链状神经系统、节状神经系统、管状神经系统等几个主要的发展阶段。脑的出现在神经系统的进化史上有着特别重要的意义。</p>\n<p>脑成为调节和支配动物行为的最高司令部。</p>\n<p>从低等的脊椎动物（如鱼），到高等脊椎动物（如人类），脑是进化是遵循以下方向不断完善的：脑的相对大小的变化，在动物进化史上，脑或神经系统的大小与动物行为的复杂程度是相关的；皮层相对大小的变化，在脊椎动物脑的进化中，新皮层大小的增加具有重要的意义；皮层内部结构的变化等。</p>\n<p>2）神经系统由于结构和机能的不同，可以将神经系统分成中枢神经系统和周围神经系统两部分，从进化论的观点来看其各自的发展：周围神经系统有三部分组成：脊神经、脑神经、植物性神经；中枢神经系统包括脊髓与脑干、间脑、小脑、边缘系统，各自顺势发展，边缘系统比脑干、间脑、小脑出现得更晚些。</p>\n<p>在系统发生的阶梯上，哺乳动物以下的有机体没有边缘系统，随着人类的进化边缘系统好像能抑制某些本能行为的模式，是机体对环境的变化能做出更好的反应等。</p>\n<p> </p>\n</div>\n</div>", "first_tag": "Others", "cpp": 0, "csharp": 0, "python": 0, "javascript": 0, "java": 0, "sql": 0, "php": 0, "time": "2022-09-07 13:12:40", "summary": "动物的神经系统是怎样构造的？动物的神经系统：指人和多细胞动物体内调节务器官的活动和适应外界环境的全部神经装置。主要由神经细胞即神经元组成。低等动物如水螅，神经系统是一个简单的网络，称网状神经系；涡虫等"}