{"blogid": "126742910", "writerAge": "码龄134天", "writerBlogNum": "21", "writerCollect": "31", "writerComment": "3", "writerFan": "21", "writerGrade": "4级", "writerIntegral": "1446", "writerName": "开放隐私计算", "writerProfileAdress": "..\\..\\static\\writer_image\\profile_126742910.jpg", "writerRankTotal": "16529", "writerRankWeekly": "120413", "writerThumb": "4", "writerVisitNum": "18697", "blog_read_count": "10", "blog_time": "于 2022-09-07 12:01:48 发布", "blog_title": "你有“隐私泄露担忧”吗？适合普通用户的6个方法来了", "content": "<div class=\"article_content clearfix\" id=\"article_content\">\n<link href=\"../../static/bootstrap/css/csdnstyle.css\" rel=\"stylesheet\"/>\n<div class=\"htmledit_views\" id=\"content_views\">\n<blockquote>\n<p>近日，国际知名数据管理公司 Progress DataDirect 发布白皮书，提到“隐私数据担忧”概念，简单来说，就是对现有隐私数据保护方法、效果、政策等不够放心，存在担忧情绪。本文结合白皮书，给担心隐私数据泄露的用户提供了6个实用方法，希望帮助用户缓解“隐私泄露担忧”，从用户角度出发为隐私数据筑上“安全之墙”。</p>\n</blockquote>\n<h2>1你担心隐私数据泄露吗？</h2>\n<p>隐私数据安全的重要性已经从支付、交通、医疗、教育等关键领域普及到我们生活的方方面面，大到金融体系的个人记录，小到一次出游的行动轨迹，只要我们是这些隐私数据的“生产者”，那么隐私数据安全就值得关注。随着全球范围内相关法律法规的持续推进，各类隐私计算、数据保护技术的迭代发展，“隐私数据安全”已经在路上，但是下沉到用户的具体生活，还是会存在诸多“担忧”情绪，这些担忧可能是由于对以下问题没有肯定的答案造成的：</p>\n<ul><li> <p><strong>我们用户能否防止未经授权的数据访问？</strong></p> </li><li> <p><strong>数据服务提供商是否完全遵循隐私保护相关法律法规？</strong></p> </li><li> <p><strong>数据服务提供商是否能确保合乎道德的、合理适当地使用数据？</strong></p> </li><li> <p><strong>我们用户必须采取哪些措施来减少隐私信息的泄露？</strong></p> </li></ul>\n<p>目前这些问题的答案尚不明确。作为上层政策法规制定组织，政策法规的推进需要时间来验证；作为使用数据的服务提供商，往往需要在合规与利益之间取得平衡，并且不愿意透露太多所谓“商业机密”的数据使用方法；作为隐私数据生产者、所有者的用户，我们在使用数据服务的同时，能做些什么保护隐私数据安全呢？</p>\n<h2>2 这6个方法，从用户的角度保障隐私数据安全</h2>\n<p></p>\n<h3>方法1 确保安装的新软件无毒安全</h3>\n<p>隐私数据泄露担忧的第1个症状是<strong>软件中可能存在安全漏洞</strong>。当我们将新软件安装到本地的应用程序环境时，网络漏洞可能附带而来，且普通用户对安全漏洞的感知能力很弱，这些漏洞的存在往往悄无声息。每当新闻报道有关日常应用中新发现的安全漏洞时，我们发现这些漏洞通常都牢牢地固定在软件运行架构中。这些漏洞可能会窃取用户本地敏感数据，例如相册、通话记录、网站浏览记录等，并且会占用设备网络带宽发送到漏洞的后台。<strong>因此我们千万不要随意安装软件，尽量通过官方渠道下载安装，特别是设备发出警告的软件要及时处理。</strong></p>\n<h3>方法2 熟悉数据保护法规政策</h3>\n<p>隐私数据泄露担忧的第2个症状是<strong>对管理数据保护的规则和法律范围不熟悉不清楚</strong>。大多数数据服务提供商可能熟悉至少一项数据隐私法，例如欧盟的《通用数据保护条例(GDPR)》或我国的《个人信息保护法》，但是对于细粒度的数据保护法规并不明确，每个国家和地区对于“隐私数据”的界定、对隐私数据的分类分级标准不尽相同，这给用户带来了极大的困扰。在我们使用数据服务时往往需要同意服务提供商的“隐私条款”，大多数用户懒得去阅读分析，会选择直接同意条款，这就带来了数据保护政策上的“信息不对称”。<strong>所以，如果用户可以认真阅读，和所在地区的数据保护法律法规做比对，充分了解之后再选择是否使用该服务。</strong></p>\n<h3>方法3 明确自己的数据资产</h3>\n<p>隐私数据泄露担忧的第3个症状是<strong>缺乏对自己所拥有数据资产的完全掌控权</strong>。随着数据分析、数据挖掘的日益普及，激发了许多数据服务提供商将其结构化和非结构化数据“民主化”。从本质上讲，这意味着将他们囤积多年的数据资产推入“数据湖”，构建数据交易市场。那么，用户的哪些数据可以列入“数据资产”的范畴呢？这是我们需要明确的关键点，数据资产中有没有包含隐私信息，能否进行交易，用户需要主动去监督，保护自己的数据资产。<strong>这是一个重塑意识的过程，之前我们一般不会觉得自己是“数据的主人”，更不会意识到数据是一种资产，现在我们必须要明确这些。</strong></p>\n<h3>方法4 了解数据的使用方和使用过程</h3>\n<p>隐私数据泄露担忧的第4个症状是<strong>不知道谁在使用自己的数据、使用哪些数据和如何使用数据</strong>。首先我们可以通过加强外围防御来解决有关外部代理违反防火墙来窃取数据的担忧。此外，为了遵守相关的数据隐私法规，数据服务提供商必须提供可审计的报告，证明隐私数据没有被不当访问。这一点用户可能经常忽略，其实我们是有渠道可以看到这些报告的，例如，近期我国网信办公布了《境内互联网信息服务算法备案清单（2022年8 月）》，该清单内覆盖了阿里、字节跳动、腾讯、新浪、小米、百度、快手、美团等公司旗下应用产品的 30 种算法，包括天猫、淘宝、抖音、快手、微信等，内容覆盖了算法的基本原理和运行机制。<strong>通过分析这些报告，我们可以了解到数据是如何被使用的，用户是否获利，是否存在滥用行为</strong><strong>等。</strong></p>\n<h3>方法5 理性面对数据保护机制的不足</h3>\n<p>隐私数据泄露担忧的第5个症状是<strong>用户可能意识到：尽管有不同的法律法规在保护数据安全，但这些法规的普适性不足，仍然存在凌驾于保护之上的数据安全威胁行为发生</strong>。意识到这点时，我们不用过于惊慌失措，在当下这是一种普遍现象，需要我们理性面对。例如，在美国加州，如果“商业行为的各个方面完全发生在加州以外”，加州的数据保护法规就不再限制出售用户的个人信息。<strong>此时我们需要去枚举相应法规的各种可能条件，尽量统筹所有的有利规定来保护自己的数据安全。</strong></p>\n<h3>方法6 灵活调整数据保护策略</h3>\n<p>隐私数据泄露担忧的第6个症状是<strong>意识到过多的数据保护会阻碍用户从数据服务中受益</strong>。例如，当下非常流行且实用的推荐系统，它的价值和作用很大程度上依赖于大量的用户数据分析，如果数据量过少，则推荐的效果较差。在数据服务提供商角度，可以使用联邦学习、多方安全计算等隐私计算技术来应对，<strong>在用户角度，</strong><strong>我们可以将数据分类分级，选择需要保护的和可以公开的数据范围</strong>。用户数据不全是敏感的，也不是只有敏感数据才能进行分析助力更好地服务，对于非敏感可公开，或者是用户本身不介意公开的数据，可以充分挖掘利用，以取得在数据安全和服务满意度之间的平衡。</p>\n<h2>3 数据安全，需要多方共同努力</h2>\n<p>以往我们总是要求隐私数据安全的政策法规制定组织和数据使用方的服务提供商来保障隐私数据安全，忽略了用户在其间可以发挥的巨大作用。通过上述的6个方法，从监督监管到自我约束，相信我们用户也能为隐私数据安全贡献力量，缓解自己的“隐私泄露担忧”。</p>\n</div>\n</div>", "first_tag": "Others", "cpp": 0, "csharp": 0, "python": 0, "javascript": 0, "java": 0, "sql": 0, "php": 0, "time": "2022-09-07 12:01:48", "summary": "近日，国际知名数据管理公司发布白皮书，提到隐私数据担忧概念，简单来说，就是对现有隐私数据保护方法、效果、政策等不够放心，存在担忧情绪。本文结合白皮书，给担心隐私数据泄露的用户提供了个实用方法，希望帮助"}